T = int(input())

for tc in range(1, T+1):
    N, num = input().split()

    hex_to_bin = {
        '0': '0000',
        '1': '0001',
        '2': '0010',
        '3': '0011',
        '4': '0100',
        '5': '0101',
        '6': '0110',
        '7': '0111',
        '8': '1000',
        '9': '1001',
        'A': '1010',
        'B': '1011',
        'C': '1100',
        'D': '1101',
        'E': '1110',
        'F': '1111'
    }

    # 결과로 만들 2진수 문자열 
    result_bin = ""

    # 변환표 참고해서 2진수로 바꾸기 

    for n in num :
        result_bin += hex_to_bin[n]

    print(f"#{tc} {result_bin}")